---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetDisplayedHorizontalCurveEndpoints
source: html/b5b51314-be8e-2d68-7920-a51af4366c27.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetDisplayedHorizontalCurveEndpoints Method

Returns the endpoints of the alignment's horizontal curves.
 Only the points between DisplayedStartStation
 and DisplayedEndStation are returned.

## Syntax (C#)
```csharp
public IList<HorizontalCurveEndpoint> GetDisplayedHorizontalCurveEndpoints()
```